<?xml version="1.0" ?>
<net name="model" version="10">
	<layers>
		<layer id="0" name="Placeholder" type="Parameter" version="opset1">
			<data shape="1, 3, 224, 224" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Placeholder:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_bn/data_bn/Rsqrt/_0__cf__0" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="0" size="12"/>
			<output>
				<port id="0" precision="FP32" names="data_bn/data_bn/Rsqrt/_0__cf__0:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="data_bn/data_bn/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="data_bn/data_bn/mul:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_bn/data_bn/mul_1/_1__cf__1" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="12" size="12"/>
			<output>
				<port id="0" precision="FP32" names="data_bn/data_bn/mul_1/_1__cf__1:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data_bn/data_bn/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="data_bn/data_bn/add_1:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="1629135989" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="1629735929" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv0/pad_size/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="56" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="conv0/pad_size/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="conv0/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="conv0/pad_size:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv0/weights" type="Const" version="opset1">
			<data element_type="f32" shape="24, 3, 3, 3" offset="60" size="2592"/>
			<output>
				<port id="0" precision="FP32" names="conv0/weights:0">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv0/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv0/Conv2D:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv0/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="2652" size="96"/>
			<output>
				<port id="0" precision="FP32" names="conv0/biases:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv0/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv0/BiasAdd:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv0/conv0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv0/conv0:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="1630335899" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="1630935737" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="pad_size/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="56" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="18" name="pad_size/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="pad_size:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>114</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="pool0" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>114</dim>
					<dim>114</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool0:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="1631535965" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="1632135746" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="block0_0_conv3/pad_size/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="56" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="block0_0_conv3/pad_size/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="block0_0_conv3/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="block0_0_conv3/pad_size:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>58</dim>
					<dim>58</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="block0_0_conv3/weights" type="Const" version="opset1">
			<data element_type="f32" shape="24, 1, 1, 3, 3" offset="2748" size="864"/>
			<output>
				<port id="0" precision="FP32" names="block0_0_conv3/weights:0">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="block0_0_conv3/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>58</dim>
					<dim>58</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_conv3/depthwise:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="block0_0_conv3/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="3612" size="96"/>
			<output>
				<port id="0" precision="FP32" names="block0_0_conv3/biases:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="block0_0_conv3/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_conv3/BiasAdd:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="block0_0_conv4/weights" type="Const" version="opset1">
			<data element_type="f32" shape="58, 24, 1, 1" offset="3708" size="5568"/>
			<output>
				<port id="0" precision="FP32" names="block0_0_conv4/weights:0">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="block0_0_conv4/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_conv4/Conv2D:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="block0_0_conv4/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 58, 1, 1" offset="9276" size="232"/>
			<output>
				<port id="0" precision="FP32" names="block0_0_conv4/biases:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="block0_0_conv4/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_conv4/BiasAdd:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="block0_0_conv4/block0_0_conv4" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="block0_0_conv4/block0_0_conv4:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="block0_0_conv0/weights" type="Const" version="opset1">
			<data element_type="f32" shape="58, 24, 1, 1" offset="9508" size="5568"/>
			<output>
				<port id="0" precision="FP32" names="block0_0_conv0/weights:0">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="block0_0_conv0/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_conv0/Conv2D:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="block0_0_conv0/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 58, 1, 1" offset="15076" size="232"/>
			<output>
				<port id="0" precision="FP32" names="block0_0_conv0/biases:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="block0_0_conv0/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_conv0/BiasAdd:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="block0_0_conv0/block0_0_conv0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="block0_0_conv0/block0_0_conv0:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="1632735413" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="1633335830" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="block0_0_conv1/pad_size/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="56" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="block0_0_conv1/pad_size/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="block0_0_conv1/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="block0_0_conv1/pad_size:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>58</dim>
					<dim>58</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="block0_0_conv1/weights" type="Const" version="opset1">
			<data element_type="f32" shape="58, 1, 1, 3, 3" offset="15308" size="2088"/>
			<output>
				<port id="0" precision="FP32" names="block0_0_conv1/weights:0">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="block0_0_conv1/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>58</dim>
					<dim>58</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_conv1/depthwise:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="block0_0_conv1/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 58, 1, 1" offset="17396" size="232"/>
			<output>
				<port id="0" precision="FP32" names="block0_0_conv1/biases:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="block0_0_conv1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="block0_0_conv2/weights" type="Const" version="opset1">
			<data element_type="f32" shape="58, 58, 1, 1" offset="17628" size="13456"/>
			<output>
				<port id="0" precision="FP32" names="block0_0_conv2/weights:0">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="block0_0_conv2/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_conv2/Conv2D:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="block0_0_conv2/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 58, 1, 1" offset="31084" size="232"/>
			<output>
				<port id="0" precision="FP32" names="block0_0_conv2/biases:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="block0_0_conv2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_conv2/BiasAdd:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="block0_0_conv2/block0_0_conv2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="block0_0_conv2/block0_0_conv2:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="block0_0_concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="block0_0_concat/Transpose/value1497435401" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="31316" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="block0_0_concat/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_concat:0">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>116</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="block0_0_reshape0/shape35530" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="31348" size="32"/>
			<output>
				<port id="0" precision="I64" names="block0_0_reshape0/shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="block0_0_reshape0" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>116</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>784</dim>
					<dim>2</dim>
					<dim>58</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="block0_0_reshape0/Transpose/value1510635464" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="31380" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="block0_0_reshape0/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>784</dim>
					<dim>2</dim>
					<dim>58</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_reshape0:0,block0_0_transpose:0">
					<dim>1</dim>
					<dim>784</dim>
					<dim>58</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="block0_0_reshape1/shape35926" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="31412" size="32"/>
			<output>
				<port id="0" precision="I64" names="block0_0_reshape1/shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="block0_0_reshape1" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>784</dim>
					<dim>58</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>116</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="block0_0_reshape1/Transpose/value1511035779" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="31444" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="block0_0_reshape1/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>116</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_0_reshape1:0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="1654335695" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="31476" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="66" name="922635815" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="31484" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="block0_1_slice-Slice0/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="block0_1_slice-Slice0:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="4" precision="FP32" names="block0_1_slice-Slice1:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="block0_1_conv0/weights" type="Const" version="opset1">
			<data element_type="f32" shape="58, 58, 1, 1" offset="31500" size="13456"/>
			<output>
				<port id="0" precision="FP32" names="block0_1_conv0/weights:0">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="block0_1_conv0/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_1_conv0/Conv2D:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="block0_1_conv0/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 58, 1, 1" offset="44956" size="232"/>
			<output>
				<port id="0" precision="FP32" names="block0_1_conv0/biases:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="block0_1_conv0/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_1_conv0/BiasAdd:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="block0_1_conv0/block0_1_conv0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="block0_1_conv0/block0_1_conv0:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="1633935758" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="1634535704" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="block0_1_conv1/pad_size/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="56" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="76" name="block0_1_conv1/pad_size/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="77" name="block0_1_conv1/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="block0_1_conv1/pad_size:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="block0_1_conv1/weights" type="Const" version="opset1">
			<data element_type="f32" shape="58, 1, 1, 3, 3" offset="45188" size="2088"/>
			<output>
				<port id="0" precision="FP32" names="block0_1_conv1/weights:0">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="block0_1_conv1/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_1_conv1/depthwise:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="block0_1_conv1/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 58, 1, 1" offset="47276" size="232"/>
			<output>
				<port id="0" precision="FP32" names="block0_1_conv1/biases:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="block0_1_conv1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_1_conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="block0_1_conv2/weights" type="Const" version="opset1">
			<data element_type="f32" shape="58, 58, 1, 1" offset="47508" size="13456"/>
			<output>
				<port id="0" precision="FP32" names="block0_1_conv2/weights:0">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="block0_1_conv2/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_1_conv2/Conv2D:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="block0_1_conv2/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 58, 1, 1" offset="60964" size="232"/>
			<output>
				<port id="0" precision="FP32" names="block0_1_conv2/biases:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="block0_1_conv2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_1_conv2/BiasAdd:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="block0_1_conv2/block0_1_conv2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="block0_1_conv2/block0_1_conv2:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="block0_1_concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="block0_1_concat/Transpose/value1498235656" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="31316" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="block0_1_concat/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_1_concat:0">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>116</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="block0_0_reshape0/shape35872" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="31348" size="32"/>
			<output>
				<port id="0" precision="I64" names="block0_0_reshape0/shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="block0_1_reshape0" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>116</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>784</dim>
					<dim>2</dim>
					<dim>58</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="block0_1_reshape0/Transpose/value1511435647" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="31380" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="block0_1_reshape0/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>784</dim>
					<dim>2</dim>
					<dim>58</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_1_reshape0:0,block0_1_transpose:0">
					<dim>1</dim>
					<dim>784</dim>
					<dim>58</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="block0_0_reshape1/shape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="31412" size="32"/>
			<output>
				<port id="0" precision="I64" names="block0_0_reshape1/shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="block0_1_reshape1" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>784</dim>
					<dim>58</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>116</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="block0_1_reshape1/Transpose/value1511835515" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="31444" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="block0_1_reshape1/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>116</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_1_reshape1:0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="1654935314" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="31476" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="99" name="923135719" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="31484" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="block0_2_slice-Slice0/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="block0_2_slice-Slice0:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="4" precision="FP32" names="block0_2_slice-Slice1:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="block0_2_conv0/weights" type="Const" version="opset1">
			<data element_type="f32" shape="58, 58, 1, 1" offset="61196" size="13456"/>
			<output>
				<port id="0" precision="FP32" names="block0_2_conv0/weights:0">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="block0_2_conv0/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_2_conv0/Conv2D:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="block0_2_conv0/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 58, 1, 1" offset="74652" size="232"/>
			<output>
				<port id="0" precision="FP32" names="block0_2_conv0/biases:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="block0_2_conv0/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_2_conv0/BiasAdd:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="block0_2_conv0/block0_2_conv0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="block0_2_conv0/block0_2_conv0:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="1635136067" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="1635736022" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="block0_2_conv1/pad_size/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="56" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="109" name="block0_2_conv1/pad_size/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="110" name="block0_2_conv1/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="block0_2_conv1/pad_size:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="block0_2_conv1/weights" type="Const" version="opset1">
			<data element_type="f32" shape="58, 1, 1, 3, 3" offset="74884" size="2088"/>
			<output>
				<port id="0" precision="FP32" names="block0_2_conv1/weights:0">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="block0_2_conv1/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_2_conv1/depthwise:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="block0_2_conv1/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 58, 1, 1" offset="76972" size="232"/>
			<output>
				<port id="0" precision="FP32" names="block0_2_conv1/biases:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="block0_2_conv1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_2_conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="block0_2_conv2/weights" type="Const" version="opset1">
			<data element_type="f32" shape="58, 58, 1, 1" offset="77204" size="13456"/>
			<output>
				<port id="0" precision="FP32" names="block0_2_conv2/weights:0">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="block0_2_conv2/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_2_conv2/Conv2D:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="block0_2_conv2/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 58, 1, 1" offset="90660" size="232"/>
			<output>
				<port id="0" precision="FP32" names="block0_2_conv2/biases:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="block0_2_conv2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="block0_2_conv2/BiasAdd:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="block0_2_conv2/block0_2_conv2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="block0_2_conv2/block0_2_conv2:0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="block0_2_concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>28</dim>
					<dim>28</dim>
